applications/solvers/lagrangian/icoUncoupledKinematicParcelFoam_with_ACMI/oscillatingInletACMI2D_particle/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(0.95 0.5 0.05)
(1.2 0.5 0.05)
)

// ************************************************************************* //
